MakePayment_Init3DPayment/Makepayment_3D req

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/" xmlns:trev="http://schemas.datacontract.org/2004/07/Trevoo.WS.Entities.Base" xmlns:trev1="http://schemas.datacontract.org/2004/07/Trevoo.WS.IO.Shopping">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:MakePayment_Init3DPayment>
         <!--Optional:-->
         <tem:request>
            <!--Optional:-->
            <trev:AuthenticationHeader>
               <!--Optional:-->
               <trev:SessionId>7537396</trev:SessionId>
               <!--Optional:-->
               <trev:SessionToken>037f4dfb-d82c-4813-ac09-047395987712</trev:SessionToken>
            </trev:AuthenticationHeader>
            <!--Optional:-->
            <trev:ExtraParamList>
               <!--Zero or more repetitions:-->
            </trev:ExtraParamList>
            <!--Optional:-->
            <trev1:DeductLastSellerCommission>false</trev1:DeductLastSellerCommission>
            <!--Optional:-->
            <trev1:Form>
               <!--Optional:-->
               <trev1:Amount>3678.0</trev1:Amount>
               <!--Optional:-->
               <trev1:BillingName>FATURA</trev1:BillingName>
               <!--Optional:-->
               <!--trev1:BonusInstallmentCount></trev1:BonusInstallmentCount-->
               <!--Optional:-->
               <trev1:CV2>000</trev1:CV2>
               <!--Optional:-->
               <trev1:CardHolder>TUGSAN</trev1:CardHolder>
               <!--Optional:-->
               <trev1:CardNumber>4506-3470-2325-3988</trev1:CardNumber>
               <!--Optional:-->
               <trev1:CardType/>
               <!--Optional:-->
               <trev1:Currency>TRY</trev1:Currency>
               <!--Optional:-->
               <trev1:ExpirationMonth>12</trev1:ExpirationMonth>
               <!--Optional:-->
               <trev1:ExpirationYear>25</trev1:ExpirationYear>
               <!--Optional:-->
               <!--trev1:InstallmentCount></trev1:InstallmentCount-->
               <!--Optional:-->
               <!--trev1:InstallmentOptionId></trev1:InstallmentOptionId-->
               <!--Optional:-->
               <!--trev1:Installment_AmountOfInterest></trev1:Installment_AmountOfInterest-->
               <!--Optional:-->
               <!--trev1:Installment_RateOfInterest></trev1:Installment_RateOfInterest-->
               <!--Optional:-->
               <trev1:OriginalAmount>3678.0</trev1:OriginalAmount>
               <!--Optional:-->
               <trev1:ReturnUrl>https://dev-ui.biletbank.local/</trev1:ReturnUrl>
               <!--Optional:-->
               <trev1:ShoppingFileId>5f2edb63-cc76-4b46-afe4-95b8a9572f3f</trev1:ShoppingFileId>
            </trev1:Form>
         </tem:request>
      </tem:MakePayment_Init3DPayment>
   </soapenv:Body>
</soapenv:Envelope>